IDEA Open Model
ShearMethod Enumeration
Compatible with IDEA StatiCa 20.1
 Method of shear calculation
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ShearMethod
Public Enumeration ShearMethod
Members
Member name | Value | Description
NoDefined | 0 |  not defined
MethodVrdcCracked | 1 |  method according 6.2.2.1
MethodVrdcPrestress | 2 |  method according 6.2.2.2
MethodVrdcSimpleHcs | 3 |  method according 6.2.2.2
MethodVrdcGeneralHcs | 4 |  method according EN1168
MethodVrdcPlain | 5 |  method according 12.6.3
MethodVrds | 6 |  method according 6.2.3.3
MethodJoints | 7 |  method according 6.2.5(1)
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace